Revit 2027 API
AllowedValues Enumeration
 A range of allowed values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AllowedValues
Public Enumeration AllowedValues
public enum class AllowedValues
type AllowedValues
Members
Member name | Value | Description
All | 1 |  All values are allowed.
NonNegative | 0 |  Only non-negative values are allowed. A tolerance of 1.0e-9 is used, so very small negative numbers are accepted.
Positive | 2 |  Only positive values are allowed. A tolerance of 1.0e-9 is used, so very small positive numbers are rejected.
See Also
Reference
Autodesk.Revit.DB Namespace